"""
    面向过程:思考的是步骤(自顶之下,逐步展开)
    面向对象:识别对象(找谁),分配职责(干嘛)
           基本流程:现实事物 -抽象化-> 类  -具体化->  对象
    类和对象
        class 类名:
            def __init__(self,参数):
                self.数据 = 参数

        def 行为(self):
            ...

        对象名 = 类名(数据)

    实例成员
        含义:
            实例变量:对象的数据(名词性的修饰)
                    表示每个对象自己的数据
            实例方法:对象的方法
                    操作实例变量
        语法:
            实例变量
                对象.变量名
            实例方法
                def 行为(self):
                    ...
"""
