"""
    深拷贝
    exercise:exercise01
"""
# 准备拷贝工具
import copy

list01 = [
    [10, 20, 30],
    [40, 50, 60],
]
list02 = list01[:]  # 浅拷贝
list03 = copy.deepcopy(list01)  # 深拷贝

# 验证:
# 浅拷贝修改深层,互相影响
# list02[0][0] = "十"
# print(list01) # [[10, 20, 30], [40, 50, 60]]

# 浅拷贝修改第一层,互不影响
# list02[0] = "列表"
# print(list01)# [[10, 20, 30], [40, 50, 60]]
# print(list02)#　['列表', [40, 50, 60]]

# 深拷贝修改,互不影响
list03[0] = "列表"
list03[1][0] = "四十"
print(list01)# [[10, 20, 30], [40, 50, 60]]
print(list03)# ['列表', ['四十', 50, 60]]
