
import copy

list01 = [
    ["烤鸭", "豆汁"],
    ["火锅", "兔头"],
    ["麻花", "包子"],
]
list02 = list01
list03 = list01[:]
list04 = copy.deepcopy(list01)

list04[0] = ["全聚德", "大董"]
print(list04)  # [['全聚德', '大董'], ['火锅', '兔头'], ['麻花', '包子']]
print(list01)  # [['烤鸭', '豆汁'], ['火锅', '兔头'], ['麻花', '包子']]

# 索引修改:将右侧列表地址,赋值给左侧
list03[0][1] = ["全聚德", "大董"]
print(list03)  # [['烤鸭', ['全聚德', '大董']], ['火锅', '兔头'], ['麻花', '包子']]
print(list01)  # [['烤鸭', ['全聚德', '大董']], ['火锅', '兔头'], ['麻花', '包子']]

# 切片修改:遍历右侧列表,将元素依次赋值给左侧
list02[1][:] = ["全聚德", "大董"]
print(list02)  # [['烤鸭', ['全聚德', '大董']], ['全聚德', '大董'], ['麻花', '包子']]
print(list01)  # [['烤鸭', ['全聚德', '大董']], ['全聚德', '大董'], ['麻花', '包子']]
